<a href="https://colab.research.google.com/github/iampramodyadav/SQL/blob/main/3_2_SQL_Hands_on_Lab(IBM_Coursera).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Databases and SQL for Data Science with Python: IBM (Coursera)


---


In this Notebook I implemented HANDS ON LAB of problems in python via SqlAlchemy

# Loading Dataset ans creating sql connection

In [4]:
!wget --header="Host: doc-0o-bo-docs.googleusercontent.com" --header="User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.114 Safari/537.36 Edg/91.0.864.59" --header="Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9" --header="Accept-Language: en-US,en;q=0.9" --header="Cookie: AUTH_ujbqda0skqord9mt5apv7iem3lr8edhh_nonce=bn5j5uk2oigkk" --header="Connection: keep-alive" "https://doc-0o-bo-docs.googleusercontent.com/docs/securesc/qi8emsu4tmv5jrtccc5loc5rti60j2jr/06t6p4okhrhog6a19jkt3dk95tl6eoom/1625043750000/11188729884457963495/11188729884457963495/1cauxWAlu8kUyhoSnTL_kxUgJBKBiCTCP?e=download&authuser=0&nonce=bn5j5uk2oigkk&user=11188729884457963495&hash=m6323655p2uldftqpthdaokrhkk9rpmc" -c -O 'dataset.csv'

--2021-06-30 09:03:11--  https://doc-0o-bo-docs.googleusercontent.com/docs/securesc/qi8emsu4tmv5jrtccc5loc5rti60j2jr/06t6p4okhrhog6a19jkt3dk95tl6eoom/1625043750000/11188729884457963495/11188729884457963495/1cauxWAlu8kUyhoSnTL_kxUgJBKBiCTCP?e=download&authuser=0&nonce=bn5j5uk2oigkk&user=11188729884457963495&hash=m6323655p2uldftqpthdaokrhkk9rpmc
Resolving doc-0o-bo-docs.googleusercontent.com (doc-0o-bo-docs.googleusercontent.com)... 74.125.204.132, 2404:6800:4008:c04::84
Connecting to doc-0o-bo-docs.googleusercontent.com (doc-0o-bo-docs.googleusercontent.com)|74.125.204.132|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 251 [text/csv]
Saving to: ‘dataset.csv’

dataset.csv         100%[===================>]     251  --.-KB/s    in 0s

2021-06-30 09:03:11 (7.82 MB/s) - ‘dataset.csv’ saved [251/251]

In [5]:
import pandas as pd
from sqlalchemy import create_engine

In [ ]:
#from google.colab import drive
#drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
#PETRESCUE=pd.read_csv('/content/drive/MyDrive/dataset/dataset.csv')

In [6]:
PETRESCUE=pd.read_csv('dataset.csv')

In [7]:
PETRESCUE.head()

   ID  ANIMAL  QUANTITY    COST  RESCUEDATE
0   1     Cat         9  450.09  2018-05-29
1   2     Dog         3  666.66  2018-06-01
2   3     Dog         1  100.00  2018-06-04
3   4  Parrot         2   50.00  2018-06-04
4   5     Dog         1   75.75  2018-06-10

In [8]:
PETRESCUE=PETRESCUE.set_index('ID')

In [11]:
PETRESCUE.head(8)

      ANIMAL  QUANTITY    COST  RESCUEDATE
ID
1        Cat         9  450.09  2018-05-29
2        Dog         3  666.66  2018-06-01
3        Dog         1  100.00  2018-06-04
4     Parrot         2   50.00  2018-06-04
5        Dog         1   75.75  2018-06-10
6    Hamster         6   60.60  2018-06-11
7        Cat         1   44.44  2018-06-11
8   Goldfish        24   48.48  2018-06-14

In [12]:
temp_db = create_engine('sqlite:///:memory:')
PETRESCUE.to_sql(name='PETRESCUE',con=temp_db)

In [13]:
pd.read_sql(sql='PETRESCUE',con=temp_db)

   ID    ANIMAL  QUANTITY    COST  RESCUEDATE
0   1       Cat         9  450.09  2018-05-29
1   2       Dog         3  666.66  2018-06-01
2   3       Dog         1  100.00  2018-06-04
3   4    Parrot         2   50.00  2018-06-04
4   5       Dog         1   75.75  2018-06-10
5   6   Hamster         6   60.60  2018-06-11
6   7       Cat         1   44.44  2018-06-11
7   8  Goldfish        24   48.48  2018-06-14

In [14]:
pd.read_sql_query(sql="""SELECT *  FROM PETRESCUE""",con=temp_db)

   ID    ANIMAL  QUANTITY    COST  RESCUEDATE
0   1       Cat         9  450.09  2018-05-29
1   2       Dog         3  666.66  2018-06-01
2   3       Dog         1  100.00  2018-06-04
3   4    Parrot         2   50.00  2018-06-04
4   5       Dog         1   75.75  2018-06-10
5   6   Hamster         6   60.60  2018-06-11
6   7       Cat         1   44.44  2018-06-11
7   8  Goldfish        24   48.48  2018-06-14

# Exercise 2: Aggregate Functions
* Query A1: Enter a function that calculates the total cost of all animal rescues in the PETRESCUE table.

* Query A2: Enter a function that displays the total cost of all animal rescues in the PETRESCUE table in a column called SUM_OF_COST.

* Query A3: Enter a function that displays the maximum quantity of animals rescued.

* Query A4: Enter a function that displays the average cost of animals rescued.

* Query A5: Enter a function that displays the average cost of rescuing a dog.

In [15]:
#Query A1
pd.read_sql_query(sql="""

                        SELECT SUM(COST)  FROM PETRESCUE

                      """,con=temp_db)

   SUM(COST)
0    1496.02

In [16]:
#Query A2
pd.read_sql_query(sql="""

                          SELECT SUM(COST) AS SUM_OF_COST FROM PETRESCUE
                          
                      """,con=temp_db)

   SUM_OF_COST
0      1496.02

In [17]:
#Query A3
pd.read_sql_query(sql="""

                        SELECT MAX(QUANTITY)  FROM PETRESCUE
                        
                      """,con=temp_db)

   MAX(QUANTITY)
0             24

In [18]:
#Query A4
pd.read_sql_query(sql="""
                          SELECT AVG(COST)  FROM PETRESCUE
                          
                        """,con=temp_db)

   AVG(COST)
0   187.0025

In [27]:
#Query A5
pd.read_sql_query(sql="""
                          SELECT AVG(COST/QUANTITY)
                          FROM PETRESCUE
                          WHERE ANIMAL='Dog'
             
                        """,con=temp_db)

   AVG(COST/QUANTITY)
0          132.656667



# Exercise 3: Scalar and String Functions
* Query B1: Enter a function that displays the rounded cost of each rescue.

* Query B2: Enter a function that displays the length of each animal name.

* Query B3: Enter a function that displays the animal name in each rescue in uppercase.

* Query B4: Enter a function that displays the animal name in each rescue in uppercase without duplications.

* Query B5: Enter a query that displays all the columns from the PETRESCUE table, where the animal(s) rescued are cats. Use cat in lower case in the query.

In [29]:
#Query B1
pd.read_sql_query(sql="""
                          SELECT ROUND(COST)  
                          FROM PETRESCUE
                          
                        """,con=temp_db)

   ROUND(COST)
0        450.0
1        667.0
2        100.0
3         50.0
4         76.0
5         61.0
6         44.0
7         48.0

In [30]:
#Query B2
pd.read_sql_query(sql="""
                          SELECT LENGTH(ANIMAL)
                          FROM PETRESCUE
                          
                        """,con=temp_db)

   LENGTH(ANIMAL)
0               3
1               3
2               3
3               6
4               3
5               7
6               3
7               8

In [1]:
#Query B3
pd.read_sql_query(sql="""
                      SELECT UCASE(ANIMAL) FROM PETRESCUE
                       """,con=temp_db)

In [2]:
#Query B4
pd.read_sql_query(sql=""" 
                        SELECT DISTINCT(UCASE(ANIMAL)) 
                        FROM PETRESCUE 
                        
                      """,con=temp_db)

In [3]:
#Query B5
pd.read_sql_query(sql="""
                          SELECT * FROM PETRESCUE 
                          WHERE LCASE(ANIMAL)='cat'
                          
                        """,con=temp_db)


# Exercise 4: Date and Time Functions
* Query C1: Enter a function that displays the day of the month when cats have been rescued.

* Query C2: Enter a function that displays the number of rescues on the 5th month.

* Query C3: Enter a function that displays the number of rescues on the 14th day of the month.

* Query C4: Animals rescued should see the vet within three days of arrivals. Enter a function that displays the third day from each rescue.

* Query C5: Enter a function that displays the length of time the animals have been rescued; the difference between today’s date and the rescue date.

In [4]:
#Query C1
pd.read_sql_query(sql="""
                          SELECT DAY(RESCUEDATE) FROM PETRESCUE 
                          WHERE ANIMAL='Cat';
                          
                        """,con=temp_db)

In [ ]:
#Query C2
pd.read_sql_query(sql="""
                          SELECT SUM(QUANTITY) FROM PETRESCUE
                          WHERE MONTH(RESCUEDATE)=05
                          
                        """,con=temp_db)

In [ ]:
#Query C3
pd.read_sql_query(sql="""
                          SELECT SUM(QUANTITY) FROM PETRESCUE
                          WHERE DAY(RESCUEDATE)=14
                          
                        """,con=temp_db)

In [ ]:
#Query C4
pd.read_sql_query(sql="""
                          SELECT (RESCUEDATE + 3 DAYS)
                          FROM PETRESCUE
                          
                        """,con=temp_db)

In [ ]:
#Query C5
pd.read_sql_query(sql="""
                          SELECT (CURRENT DATE - RESCUEDATE) FROM PETRESCUE;
                          
                        """,con=temp_db)



---